---
kind: type
id: T:Autodesk.Revit.DB.DetailEllipse
source: html/51856272-25b9-c581-6292-f83de380b864.htm
---
# Autodesk.Revit.DB.DetailEllipse

Represents a DetailEllipse within Autodesk Revit.

## Syntax (C#)
```csharp
public class DetailEllipse : DetailCurve
```

## Remarks
Currently it's just a place holder for specific type.
All the geometry-related functionality is provided by geometry curve object from
DetailCurve::geometryCurve property.